Revit 2027 API
MaterialNode.Glossiness Property
 The level of glossiness of the material
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Glossiness { get; }
Public ReadOnly Property Glossiness As Integer
	Get
public:
property int Glossiness {
	int get ();
}
member Glossiness : int with get
Property Value
Int32
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace